# Getting Started with pandas

In [14]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

## Series

In [5]:
obj = pd.Series([4,5,-5,3]) #Contains a sequence of values and data labels
obj

0    4
1    5
2   -5
3    3
dtype: int64

In [8]:
obj.values #Values in the Series

array([ 4,  5, -5,  3], dtype=int64)

In [10]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c']) #Create series and specifc data labels
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [16]:
obj2["a"] #Access values by data labels

-5

In [18]:
obj2[obj2>0] #Preserved index-value link

d    4
b    7
c    3
dtype: int64

In [20]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata) #Convert from dictionary to Series
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states) #Can pass in keys to produce certain order
obj4 #Californian produces NaN as there is no value for it in sdata

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
pd.isnull(obj4) #Outputs which data is null

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
obj3+obj4 #Automatically aligns arithmetic with key labels

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [74]:
obj4.name = "Polulation" #Change attributes
obj4.index.name = "State" #Sets the index name to "States"
obj4

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Polulation, dtype: float64

## DataFrame

In [34]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data) #Create DataFrame from dictionary
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [37]:
frame.head() #Outputs the first 5 rows

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [53]:
#Arrange DataFrame in certain order with index
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop','debt'],index = ['one', 'two', 'three', 'four','five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [54]:
frame2['state'] #Retrieve column as a series by dict-notation

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [55]:
frame2.year #Retrieve column by attribute notation

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [56]:
frame2.loc['three'] #Retrive row by name

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [59]:
frame2.debt = 16.5 #Set the debt of all rows to 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [61]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five']) #Set specific index values
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [68]:
frame2["eastern"] = frame2.state == "Ohio" #Create a new column
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [69]:
del frame2["eastern"] #Delete the column
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [71]:
#When passing a nested dictionary, the outer keys are column headings and inner keys are row indexes
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [73]:
frame3.T #Transpose to "rotate" the frame

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [76]:
frame3.values #Outputs the data in the DataFrame

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

## Index Objects

In [5]:
obj = pd.Series(range(3), index = ['a','b','c']) #Index holds the axis labels and other metadata
obj

a    0
b    1
c    2
dtype: int64

In [8]:
ind = obj.index
ind

Index(['a', 'b', 'c'], dtype='object')

In [12]:
ind[1] = 'd' #Index objects are immutable

TypeError: Index does not support mutable operations

In [15]:
labels = pd.Index(np.arange(3))

obj = pd.Series([1.5,-2.5,0], index = labels)
obj

0    1.5
1   -2.5
2    0.0
dtype: float64

In [17]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar']) #Indexes can contain duplicates
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## Reindexing

In [20]:
obj = pd.Series([1.5,6,9.0,11], index = ['b','d','a','c'])
obj

b     1.5
d     6.0
a     9.0
c    11.0
dtype: float64

In [24]:
obj = obj.reindex(['a','b','c','d','e']) #Rearranges the indexes into a specific order, filling in gaps
obj

a     9.0
b     1.5
c    11.0
d     6.0
e     NaN
dtype: float64

In [26]:
obj = pd.Series(["blue","purple","yellow"], index = [0, 2, 4])
obj

0      blue
2    purple
4    yellow
dtype: object

In [28]:
obj.reindex(range(6), method = "ffill") #Fills in values when indexing using forward fill

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [31]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index = ["a", "c", "d"], columns = ["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [33]:
frame2 = frame.reindex(["a","b","c","d"]) #Reindexes the rows
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [37]:
states = ["Texas","Utah","California"]
frame.reindex(columns=states) #Reindex the columns and fill in values

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [55]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [41]:
newobj = obj.drop("c") #Deletes the row indexed by c in a series
newobj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [42]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [43]:
data.drop(["Ohio", "Utah"]) #Removes from axis 0 (rows)

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [46]:
data.drop("two", axis = 1) #Removes from axis 1 (columns)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [50]:
data.drop(['two', 'four'], axis='columns') #Drop explicitly from columns

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [52]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [56]:
obj.drop('c', inplace=True) #Removes from the actual series (i.e. in place)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

## Indexing, Selection and Filtering

In [57]:
obj = pd.Series(np.arange(4.), index = ["a","b","c","d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [62]:
obj[1] #Access by ith index

1.0

In [61]:
obj["b"] #Access by specific index

1.0

In [64]:
obj[['b', 'a', 'd']] #Access specific indexes

b    1.0
a    0.0
d    3.0
dtype: float64

In [66]:
 obj[obj < 2] #Access values less than 2

a    0.0
b    1.0
dtype: float64

In [67]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [69]:
obj["c":"d"] #Inclusive of end point

c    2.0
d    3.0
dtype: float64

In [70]:
obj["b":"d"] = 5
obj

a    0.0
b    5.0
c    5.0
d    5.0
dtype: float64

In [71]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [73]:
data["two"] #Displays entire column

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [75]:
data[:2] #Select the first 2 rows

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [82]:
data > 5 #Boolean comparison

            one    two  three   four
Ohio      False  False  False  False
Colorado  False  False   True   True
Utah       True   True   True   True
New York   True   True   True   True

In [83]:
data[data['three'] > 5] #Select rows where the third row > 5

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### loc selects by label, iloc selects by index

In [87]:
data.loc["Colorado", ["two","three"]] #Select row colorado and columns two and three by label

two      5
three    6
Name: Colorado, dtype: int32

In [88]:
data.iloc[2, [3, 0, 1]] #Selects the row at index 2 and the columns at index 3,0 and 1

four    11
one      8
two      9
Name: Utah, dtype: int32

In [89]:
data.loc[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [91]:
data.iloc[:, :3][data.three > 5] #Selects all the rows and colums up to the 3rd index where data.three > 5

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [93]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1] #Can only use this syntax if using non-integer indexes

2.0

## Arithmetic and Data Alignment

In [95]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [96]:
s2 = pd.Series([-2.1,3.6,-1.5,4,3.1], index = ["a","c","e","f","g"])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [98]:
s1+s2 #Addition with series

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [99]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [100]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [102]:
df1 + df2 #Addition with DataFrames

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [108]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [117]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df2.loc[1,"b"] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [118]:
df1 + df2 #Add 2 DataFrames

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [119]:
df1.add(df2, fill_value = 0) #Fill areas where an axis label is found in one but not the other (avoids NaN)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [120]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [122]:
df1.rdiv(1) #Same as 1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [125]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [126]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [128]:
frame - series #Arithmetic matched the indexes and is done down each row

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [129]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [131]:
frame.sub(series3, axis="index") #Dubtraces the column from each index column

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## Function Applicating and Mapping

In [133]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame #Data consists on random numbers

               b         d         e
Utah   -1.219160  1.748064  2.171874
Ohio    0.701104 -0.248000 -1.053001
Texas  -0.020067  1.039424 -0.935435
Oregon -0.305948 -2.085384 -0.150193

In [134]:
np.abs(frame)

               b         d         e
Utah    1.219160  1.748064  2.171874
Ohio    0.701104  0.248000  1.053001
Texas   0.020067  1.039424  0.935435
Oregon  0.305948  2.085384  0.150193

In [135]:
f = lambda x: x.max() - x.min() #Lambda function to calculate range
frame.apply(f)

b    1.920264
d    3.833448
e    3.224875
dtype: float64

In [137]:
frame.apply(f, axis = 1) #Apply on the rows

Utah      3.391034
Ohio      1.754105
Texas     1.974859
Oregon    1.935191
dtype: float64

In [139]:
def f(x):
    return pd.Series([x.min(), x.max()], index = ["Min","Max"])

frame.apply(f) #Return a series with min and max

            b         d         e
Min -1.219160 -2.085384 -1.053001
Max  0.701104  1.748064  2.171874

In [141]:
format = lambda x: '%.2f' % x
frame.applymap(format) #Applies string formatting

            b      d      e
Utah    -1.22   1.75   2.17
Ohio     0.70  -0.25  -1.05
Texas   -0.02   1.04  -0.94
Oregon  -0.31  -2.09  -0.15

In [147]:
frame["e"].map(format) #Applies to column

Utah       2.17
Ohio      -1.05
Texas     -0.94
Oregon    -0.15
Name: e, dtype: object

## Sorting and Ranking

In [149]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [151]:
obj.sort_index() #Sores the indexes in lexographical order

a    1
b    2
c    3
d    0
dtype: int64

In [153]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),index=['three', 'one'],columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [156]:
frame.sort_index() #Sort rows

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [157]:
frame.sort_index(axis=1) #Sort columns

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [159]:
frame.sort_index(axis=1, ascending=False) #Sort in descending order

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [161]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values() #NaN values added to end

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [163]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [166]:
frame.sort_values(by="b") #Sort b's values which will then rearrange a's in the same order

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [168]:
frame.sort_values(by=['a', 'b']) #Sort by multiple columns

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [170]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
#Assigns ranks to each index, as -5 is the smallest it is given rank 1, where there is a tie the mean rank is given
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [173]:
#Ranks assigned in order they are observed, as the second 7 is observed later - it is given a higher rank
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [174]:
obj.rank(ascending=False, method='max') #Rank in descending order

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [175]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [176]:
frame.rank(axis = "columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

## Axis Indexes with Duplicate Labels

In [179]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c']) #Contains duplicate idnexes
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [181]:
obj.index.is_unique #Are the indexes unqiue?

False

In [185]:
obj["a"] #Returns multiple items as the index is repeated

a    0
a    1
dtype: int64

In [186]:
obj["c"] #Returns a scalar as the index is not repeated

4

In [187]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.330519 -1.432981 -0.682738
a  0.657948 -0.555524  1.494320
b  0.133994 -1.765712  0.948583
b -0.702594 -0.369039 -0.860690

In [189]:
df.loc["b"]

          0         1         2
b  0.133994 -1.765712  0.948583
b -0.702594 -0.369039 -0.860690

## Statistics

In [190]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [194]:
df.sum() #Caulculate sum of each column

one    9.25
two   -5.80
dtype: float64

In [196]:
df.sum(axis='columns') #Calculate sum of each row

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [200]:
df.mean(axis='columns', skipna=False) #Includes all values in calculating the mean, even if NaN

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [202]:
df.idxmax() #Indexes where the maximum values are located

one    b
two    d
dtype: object

In [203]:
df.idxmin() #Indexes where the minimum values are located

one    d
two    b
dtype: object

In [208]:
df.cumsum() #Cumulative sum along the rows

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [210]:
df.describe() #Produces summary statistics

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

## Correlation and Covariance

In [212]:
import pandas_datareader.data as web

In [220]:
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']} #Access Data

In [221]:
price = pd.DataFrame({ticker: data['Adj Close']for ticker, data in all_data.items()}) #Access prices

In [222]:
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()}) #Access volume

In [223]:
returns = price.pct_change() #Calulcate percentage changes in the prices
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2021-03-29  0.001485 -0.003813 -0.005244  0.010022
2021-03-30 -0.012274 -0.008391 -0.014411 -0.000199
2021-03-31  0.018766 -0.010837  0.016907  0.006368
2021-04-01  0.006959 -0.000225  0.027909  0.033413
2021-04-05  0.023577  0.020266  0.027728  0.041071

In [224]:
returns['MSFT'].corr(returns['IBM']) #Calculate correlation

0.5317251571058244

In [226]:
returns["MSFT"].cov(returns["IBM"]) #Calculate covariance

0.00015162204871132351

In [228]:
returns.corr() #Return all correlations

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.447184  0.712419  0.650325
IBM   0.447184  1.000000  0.531725  0.499231
MSFT  0.712419  0.531725  1.000000  0.778133
GOOG  0.650325  0.499231  0.778133  1.000000

In [229]:
returns.cov() #Returns all covariances

          AAPL       IBM      MSFT      GOOG
AAPL  0.000365  0.000140  0.000237  0.000209
IBM   0.000140  0.000269  0.000152  0.000138
MSFT  0.000237  0.000152  0.000303  0.000228
GOOG  0.000209  0.000138  0.000228  0.000284

In [230]:
returns.corrwith(returns.IBM) #Correlations with specific index

AAPL    0.447184
IBM     1.000000
MSFT    0.531725
GOOG    0.499231
dtype: float64

In [232]:
 returns.corrwith(volume) #Calculates correlation with the return and corresponding volume of each company

AAPL   -0.075326
IBM    -0.115701
MSFT   -0.083638
GOOG   -0.133201
dtype: float64

## Unique Values, Value Counts, and Membership

In [236]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj.unique() #Returns the unqique elements

array(['c', 'a', 'd', 'b'], dtype=object)

In [238]:
obj.value_counts() #Count the frequency of each value

a    3
c    3
b    2
d    1
dtype: int64

In [240]:
obj.isin(['b', 'c']) #Checks whether each value is one of the specified values

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [242]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
#Matches the index of quniue_values to to_match
#As c is at index 0 in unique_vales, it is given the value 0 in to_match
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [243]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],'Qu2': [2, 3, 1, 2, 3],'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [245]:
result = data.apply(pd.value_counts).fillna(0)
#Returns the count of each value in each column
#For eaxmaple, 1 is in q1,q2 and q3 once so it is given 1,1,1
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0